In [1]:
import numpy as np
import pandas as pd

### 3.5.2 Pandas 的缺失值

#### 1. None：Python 对象类型的缺失值

In [3]:
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [4]:
for dtype in ['object', 'int']:
    print("dtype=", dtype)
    %timeit np.arange(1E6, dtype = dtype).sum()
    print()

dtype= object
49.9 ms ± 405 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype= int
2 ms ± 5.14 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

使用 Python 对象构成的数组意味着如果你对一个包含 None 的数组进行累计操作，如 sum() 或 min(), 那么通常会出现类型错误

In [7]:
# vals1.sum()

In [10]:
vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype

dtype('float64')

无论和 NaN 进行何种操作，最终结果都是 NaN

In [13]:
1 + np.nan

nan

In [14]:
0 * np.nan

nan

In [15]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

NumPy 也提供一些特征的累计函数，它们可以忽略缺失值的影响

In [18]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

#### 3. Pandas 中的 NaN 与 None 的差异

In [19]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [21]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int32

In [23]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

### 3.5.3 处理缺失值

#### 1. 发现缺失值

In [26]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [27]:
data[data.notnull()]

0        1
2    hello
dtype: object

#### 2. 剔除缺失值

In [28]:
data.dropna()

0        1
2    hello
dtype: object

In [29]:
df = pd.DataFrame([[1, np.nan, 2],
                   [2,      3, 5],
                   [np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

dropna()会剔除**任何**包含缺失值的**整行**数据

In [31]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [33]:
# df.dropna(axis= 1)

df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [35]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [36]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

可以通过 thresh 参数设置行或列中**非缺失值**的最小数量

In [38]:
df.dropna(thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [41]:
df.dropna(axis='columns', thresh=2)

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

#### 3. 填充缺失值

In [42]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [43]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [44]:
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [45]:
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [46]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [49]:
df.fillna(method='ffill')

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  2.0  4.0  6 NaN

In [48]:
df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0